{
    "en": {
      "pageTitle": "Food4All - Delicious Food Delivered",
      "navToggle": "🍔 Menu",
      "americanLink": "American Food",
      "italianLink": "Italian Food",
      "japaneseLink": "Japanese Food",
      "languageLink": "Language Select",
      "contactLink": "Contact Us",
      "payLink": "Pay",
      "welcomeHeading": "Welcome",
      "welcomeText": "Indulge in a culinary journey like no other at Food4All. We invite you to savor our diverse menu, meticulously crafted with passion and dedication to deliver an extraordinary dining experience.",
      "historyHeading": "Our History",
      "historyText": "Since our establishment in 2010, Food4All has been a symbol of culinary excellence. Over the years, we have evolved into a renowned destination for food enthusiasts seeking exquisite flavors and exceptional dining experiences.",
      "whoHeading": "Who We Are?",
      "whoText": "Food4All is more than a restaurant; we are a collective of culinary experts and enthusiasts committed to delivering an unforgettable dining experience. Our team of passionate chefs brings creativity and expertise to every dish they create, ensuring a symphony of flavors with every bite.",
      "missionHeading": "Our Mission",
      "missionText": "At Food4All, our mission is to tantalize your taste buds with a rich tapestry of flavors from American, Italian, and Japanese cuisines. We aim to create lasting memories through the joy of exceptional food and warm hospitality, setting the stage for delightful culinary experiences.",
      "footerText": "© 2023 - 2024 Food4All. All rights reserved."
    },
    "es": {
      "pageTitle": "Food4All - Comida Deliciosa a Domicilio",
      "navToggle": "🍔 Menú",
      "americanLink": "Comida Americana",
      "italianLink": "Comida Italiana",
      "japaneseLink": "Comida Japonesa",
      "languageLink": "Seleccionar Idioma",
      "contactLink": "Contáctenos",
      "payLink": "Pagar",
      "welcomeHeading": "Bienvenido",
      "welcomeText": "Disfruta de un viaje culinario como ningún otro en Food4All. Te invitamos a saborear nuestro variado menú, meticulosamente elaborado con pasión y dedicación para ofrecerte una experiencia gastronómica extraordinaria.",
      "historyHeading": "Nuestra Historia",
      "historyText": "Desde nuestra fundación en 2010, Food4All ha sido un símbolo de excelencia culinaria. A lo largo de los años, hemos evolucionado hacia un destino reconocido para los entusiastas de la comida que buscan sabores exquisitos y experiencias gastronómicas excepcionales.",
      "whoHeading": "¿Quiénes Somos?",
      "whoText": "Food4All es más que un restaurante; somos un colectivo de expertos y entusiastas de la gastronomía comprometidos a ofrecer una experiencia gastronómica inolvidable. Nuestro equipo de chefs apasionados aporta creatividad y experiencia a cada plato que crean, garantizando una sinfonía de sabores en cada bocado.",
      "missionHeading": "Nuestra Misión",
      "missionText": "En Food4All, nuestra misión es deleitar tu paladar con una rica variedad de sabores de las cocinas americana, italiana y japonesa. Buscamos crear recuerdos duraderos a través de la alegría de una comida excepcional y una cálida hospitalidad, preparando el escenario para experiencias culinarias encantadoras.",
      "footerText": "© 2023 - 2024 Food4All. Todos los derechos reservados."
    },
    "cat": {
      "pageTitle": "Food4All - Menjar Deliciós a Domicili",
      "navToggle": "🍔 Menú",
      "americanLink": "Menjar Americà",
      "italianLink": "Menjar Italià",
      "japaneseLink": "Menjar Japonès",
      "languageLink": "Selecciona l'Idioma",
      "contactLink": "Contacta'ns",
      "payLink": "Pagar",
      "welcomeHeading": "Benvingut",
      "welcomeText": "Gaudeix d'un viatge culinari com cap altre a Food4All. Et convidem a degustar el nostre variat menú, elaborat meticulosament amb passió i dedicació per oferir-te una experiència gastronòmica extraordinària.",
      "historyHeading": "La Nostra Història",
      "historyText": "Des de la nostra fundació el 2010, Food4All ha estat un símbol d'excel·lència culinària. Amb el temps, hem evolucionat cap a un destí reconegut pels amants de la gastronomia que busquen sabors exquisits i experiències culinàries excepcionals.",
      "whoHeading": "Qui Som?",
      "whoText": "Food4All és més que un restaurant; som un col·lectiu d'experts i entusiastes de la gastronomia compromesos a oferir una experiència gastronòmica inoblidable. El nostre equip de xefs apassionats aporta creativitat i experiència a cada plat que creen, garantint una simfonia de sabors amb cada mossegada.",
      "missionHeading": "La Nostra Missió",
      "missionText": "A Food4All, la nostra missió és temptar el teu paladar amb una rica varietat de sabors de les cuines americana, italiana i japonesa. Cerquem crear records duradors a través de la joia d'una cuina excepcional i una hospitalitat càlida, preparant l'escenari per a experiències culinàries encantadores.",
      "footerText": "© 2023 - 2024 Food4All. Tots els drets reservats."
    }
  }
  